#pragma once

class DirectXCommon;

class ModelCommon {
public:
  //================================================================================
  // 初期化
  //================================================================================

  /// <summary>
  /// 初期化
  /// </summary>
  /// <param name="dxCommon">DirectXCommonのポインタ</param>
  void Initialize(DirectXCommon *dxCommon);

public:
  //================================================================================
  // Getter
  //================================================================================

  // DirectXCommon
  DirectXCommon *GetDxCommon() const { return dxCommon_; }

private:
  //================================================================================
  // 外部参照
  //================================================================================
  DirectXCommon *dxCommon_ = nullptr;
};
